[
  {
    "id": "2000",
    "title": "Introducing Summit's Drilling Field Supervisors",
    "content": "Experienced Leadership Where It Matters Most—In the Field. Summit's goal has always been clear: to be the best-in-class environmental services company on the East Coast. Achieving that standard requires more than advanced equipment and regional reach, it requires exceptional leadership in the field and a relentless commitment to our clients...",
    "fullContent": "Experienced Leadership Where It Matters Most—In the Field\n\nSummit's goal has always been clear: to be the best-in-class environmental services company on the East Coast. Achieving that standard requires more than advanced equipment and regional reach, it requires exceptional leadership in the field and a relentless commitment to our clients.\n\nTo further strengthen that commitment, Summit has created a new leadership role: Drilling Field Supervisor.\n\nWhile the title is new, the experience behind it is anything but. Mike Wilson and Richy Lemire, collectively bring more than 50 years of environmental experience, having earned the respect of peers, project managers, and clients alike through decades of hands-on leadership. These seasoned professionals now serve as a critical bridge between field operations, on-site client engagement, and office management.\n\n<h2><strong>What Drilling Field Supervisors Do</strong></h2>\n\nSummit's Drilling Field Supervisors focus on four core priorities that directly impact project success:\n\n• Advance safe drilling operations through active oversight, mentoring, and field presence\n• Ensure best-in-class quality by reinforcing consistent drilling practices across crews\n• Develop and mentor field teams, strengthening skills, confidence, and career pathways\n• Serve as a client interface, ensuring clear communication and positive on-site experiences\n\nBeyond these core responsibilities, Field Supervisors provide hands-on support where it matters most—stepping in to stabilize challenging projects, overseeing large multi-crew operations, mentoring new drillers, and serving as a trusted escalation point for both field staff and clients.\n\n<h2><strong>Driving Continuous Improvement</strong></h2>\n\nSince introducing this role, Summit has already seen measurable results:\n\n• Stronger field-to-office communication\n• Improved safety performance and consistency\n• Higher field morale and engagement\n• More proactive issue resolution and client satisfaction\n\nThis role creates a true feedback loop—capturing real-time insights from the field and translating them into operational improvements across the organization.\n\n<h2><strong>Looking Ahead</strong></h2>\n\nAs Summit moves into 2026, the Drilling Field Supervisor role will become an even greater focus, supporting the recruitment of skilled helpers, expanding training programs, and building the next generation of field leaders. It is another step forward in Summit's ongoing investment in people, performance, and partnership.\n\n<em>Because exceptional results start with exceptional leadership, right in the field.</em>",
    "slug": "introducing-summits-drilling-field-supervisors",
    "date": "2025-12-23 12:00:00",
    "thumbnailId": "2001",
    "imageUrl": "/images/news/drilling-field-supervisors-banner.jpg"
  },
  {
    "id": "1988",
    "title": "Summit Drilling Welcomes Joseph C. Negro to Lead the Expansion of Remediation Services Division",
    "content": "Summit Drilling is proud to announce the addition of Joseph C. Negro as Vice President of our growing Remediation Services Division. With a proven track record in complex environmental remediation projects and a passion for environmental stewardship, Joseph brings not only extensive technical and operational experience, but also a visionary leadership style that aligns perfectly with Summit’s long-term goals and the diverse needs of our customers.\r\n\r\n<em>“Joseph joins us at an opportunistic mome...",
    "fullContent": "Summit Drilling is proud to announce the addition of Joseph C. Negro as Vice President of our growing Remediation Services Division. With a proven track record in complex environmental remediation projects and a passion for environmental stewardship, Joseph brings not only extensive technical and operational experience, but also a visionary leadership style that aligns perfectly with Summit’s long-term goals and the diverse needs of our customers.\r\n\r\n<em>“Joseph joins us at an opportunistic moment in the evolution of our Remediation Division,”</em> states Ron Bucca, Summit’s CEO. <em>“What began as a value-add capability grew through the acquisition of a specialized remediation firm and has matured into an internal capability ready to reach new heights. Joseph’s arrival represents the next step in that journey—a move that reinforces our commitment to delivering comprehensive, innovative solutions to environmental consultants and engineers across the region. We know Joseph is going to do great things for our customers for many years to come”</em>\r\n<h2><strong>An Experienced Leader with Proven Results</strong><strong> </strong></h2>\r\nJoseph’s professional background is rooted in a decade of success across the environmental services spectrum, including site assessments, remediation, project management, stakeholder engagement, and technical innovation. Most recently, he served as a Senior Project Manager for Cascade’s Environmental Remediation Services group, where, with over 350,000 cubic yards of soil mixing experience, he was instrumental in leading major In-Situ Soil Stabilization/Solidification (ISS/SCM) projects across a variety of challenging sites impacted by VOCs, PFAS, PCBs, heavy metals, and other complex contaminants.\r\n\r\nDuring his tenure at Cascade, Joseph managed more than 65,000 hours of incident-free work, spearheaded groundbreaking residential redevelopment projects in Brooklyn, and drove project performance that increased the value of individual contracts by millions. He also provided business development support on the company’s Sustainability Council and earned multiple awards.\r\n\r\nPrior to his work with Cascade, Joseph held various scientific and project roles at leading firms such as Terraphase Engineering, Renova Environmental, and ACER Associates, where he honed his technical foundation in environmental site assessments, GPS-based cell mapping, and large-scale remediation of NPL Superfund Sites. This trajectory—from scientist to strategic leader—has given him a uniquely hands-on understanding of every aspect of the remediation process.\r\n<h2><strong>A Vision for Growth and Excellence</strong></h2>\r\nJoseph’s passion for the environment and commitment to building capable, mission-driven teams is evident in every step of his career. From leading his Boy Scout troop as a teenager to presiding over the Rutgers University Glee Club, and now driving high-performing project teams in environmental contracting, Joseph has always leaned into leadership with clarity, energy, and purpose.\r\n\r\nAt Summit, his goals are ambitious yet grounded: to build a team culture that values both institutional knowledge and the energy of emerging professionals; to create opportunities for growth across all levels of the organization; and to ensure that every customer—from long-time partners to aspiring professionals—receives a consistent and exceptional experience.\r\n\r\n<em>“I'm excited to help shape the future of environmental remediation at Summit,”</em> Joseph shared. <em>“With so many in the environmental and geotechnical workforce nearing retirement, we must be intentional in developing the next generation. I’m here to build a team where learning is encouraged, safety is paramount, and exceptional service becomes second nature.”</em>\r\n\r\nJoseph also emphasizes that an exceptional remediation team isn’t built solely on technical prowess—it’s built on trust, respect, and the ability to adapt to each client’s unique needs. <em>“Customers today want more than just compliance—they want a team that listens, collaborates, and executes with excellence. That’s what we’re building here at Summit.”</em>\r\n<h2><strong>Personal Passion for Environmental Stewardship</strong></h2>\r\nJoseph’s enthusiasm for environmental work isn’t confined to the office or the field. A lifelong environmentalist and Eagle Scout, he credits his love of the outdoors and early marine science interests with setting him on this path. Though he once envisioned a career in coral reef restoration, growing up in one of the most polluted corridors of the country shifted his focus to the pressing need for land-based remediation.\r\n\r\nAt home, Joseph and his wife stay close to nature through gardening, beekeeping, and caring for koi ponds and aquariums. When not managing large-scale remediation projects or planning the future of Summit’s division, you’re likely to find him knee-deep in outdoor projects—or soaking in the salt air on a Jersey Shore beach where his environmental interests first took root.\r\n<h2><strong>Looking Ahead</strong></h2>\r\nWith Joseph at the helm, Summit’s Remediation Services Division is poised to deliver even greater value to our customers. His leadership, combined with our existing expertise and infrastructure, ensures we are well-positioned to meet today’s environmental challenges—and anticipate tomorrow’s.\r\n\r\nPlease join us in welcoming Joseph to the Summit team. His arrival marks an exciting new chapter for our Remediation Division, one defined by expertise, growth, innovation, and a renewed commitment to the environmental professionals we serve.\r\n\r\nWe’re confident that under Joseph’s leadership, Summit’s Remediation Services will not only thrive—but help raise the standard for what environmental contracting can be.\r\n\r\n<strong>Welcome aboard, Joseph. The best is yet to come.</strong>",
    "slug": "summit-drilling-welcomes-joseph-c-negro",
    "date": "2025-05-01 10:42:17",
    "thumbnailId": "1990",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2025/05/Joseph-C-Negro-Crop-scaled.jpg"
  },
  {
    "id": "1979",
    "title": "Dermot Dillon Appointed to NGWA Board of Directors",
    "content": "Summit Drilling is proud to announce that Dermot Dillon, our Vice President of Major Accounts, has been elected to the <a href=\"https://www.ngwa.org/\" target=\"_blank\" rel=\"noopener\">National Groundwater Association’s</a> (NGWA) 2025 Board of Directors. This achievement is a testament to Dermot’s unwavering dedication to the groundwater and environmental industries, and we couldn’t be more excited to see him step into this important leadership role.\r\n\r\nThis achievement is a testament to Dermot’s ...",
    "fullContent": "Summit Drilling is proud to announce that Dermot Dillon, our Vice President of Major Accounts, has been elected to the <a href=\"https://www.ngwa.org/\" target=\"_blank\" rel=\"noopener\">National Groundwater Association’s</a> (NGWA) 2025 Board of Directors. This achievement is a testament to Dermot’s unwavering dedication to the groundwater and environmental industries, and we couldn’t be more excited to see him step into this important leadership role.\r\n\r\nThis achievement is a testament to Dermot’s unwavering dedication to the groundwater and environmental industries, and we couldn’t be more excited to see him step into this important leadership role.\r\n\r\nFor over 25 years, Dermot has been an active NGWA member and a passionate advocate for groundwater stewardship. His commitment to the industry extends to the New Jersey Groundwater Association, where he has served in multiple leadership roles—including Secretary, President, and now Past President.\r\n\r\nDermot’s career began in 1984, shaped in part by his early awareness of environmental issues, such as the Love Canal disaster near his hometown of Buffalo, NY. That experience sparked a lifelong mission to contribute to environmental causes.\r\n\r\n<em>“I remember watching the news as a kid and seeing these heartbreaking images of families being evacuated from their homes,”</em> says Dermot. <em>“People were getting sick, and at the time, we didn’t fully understand the long-term impacts of environmental contamination. But even then, I knew I wanted to do something about it. I didn’t know exactly what that meant at the time, but I knew I wanted to help prevent tragedies like that from happening again.”</em>\r\n\r\n<em> </em>His passion led him into the environmental drilling industry, eventually bringing him to New Jersey, where he has built a career spanning four decades and counting. <em>“One of the most rewarding aspects of this career is seeing real, tangible results,”</em> Dermot shares. <em>“I can drive by a location today that was once a contaminated site and now see a thriving business, a park, or even a school. Knowing that I played a small role in that transformation is incredibly fulfilling.”</em>\r\n\r\nAs an industry veteran, Dermot has always sought ways to give back—especially when it comes to mentoring young professionals and supporting workforce development. <em>“I have always believed that if an industry gives you a career, a sense of purpose, and a livelihood, you owe it to that industry to give something back,”</em> he explains. <em>“Right now, one of the biggest challenges we face is the workforce. Where do we find good help, and who will step up as the next generation of environmental remediation leaders? It’s up to us to create pathways for new professionals, train them, and show them that this is not just a job, but a meaningful and rewarding career.”</em>\r\n\r\nTo help address this challenge, NGWA has partnered with Oklahoma State University to offer NGWA University, an online training program that provides education and career paths in the groundwater industry. <em>“We have to show young professionals that there’s a future in this industry,”</em> Dermot emphasizes. “<em>Programs like NGWA University are critical because they provide structured training, career guidance, and financial support for those interested in entering the field. It’s about more than just getting a job—it’s about building expertise, advancing careers, and ensuring that our industry remains strong for decades to come.”</em>\r\n\r\nAt its core, NGWA’s mission is to advance the expertise of groundwater professionals and further groundwater awareness and protection through education and outreach. For Dermot, this mission is personal. <em>“So many people take clean water for granted,”</em> he says. <em>“They turn on the faucet and expect fresh, safe water to come out. But that’s not the reality for everyone. There are communities across the country that still struggle with contaminated water supplies. If I can contribute in even a small way to improving groundwater resources and protecting public health, then I feel like I’ve done my job.”</em>\r\n\r\nWhen asked what he is most proud of in his career, Dermot doesn’t hesitate. <em>“Hands down, it’s the relationships I’ve built over the years,” he reflects. “I’ve been in this industry long enough to see guys who started out in the field with me now running their own companies or stepping into executive roles. We’ve grown together, supported each other, and stayed connected through the years. Many of these people started out as colleagues or customers, but over time, they’ve become lifelong friends. That, to me, is just as valuable as any project I’ve worked on.”</em><em> </em>\r\n\r\nSummit Drilling is privileged to have a leader like Dermot, whose dedication extends beyond his professional work to mentoring the next generation of groundwater professionals. His election to the NGWA Board of Directors is a well-earned honor, and we have no doubt that his leadership will make a lasting impact on the industry.\r\n\r\nPlease join us in congratulating Dermot Dillon on this outstanding achievement!\r\n\r\nWell done, Dermot! We are proud to have you as part of the Summit Drilling family.",
    "slug": "dermot-dillion-appointed-to-ngwa-board-of-directors",
    "date": "2025-02-18 14:59:30",
    "thumbnailId": "1980",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2025/02/Derm-Instruicting.jpg"
  },
  {
    "id": "1402",
    "title": "Summit Drilling Welcomes South Atlantic Environmental Drilling and Construction Co. (SAEDACCO) to the Team",
    "content": "The Addition Extends Summit’s Environmental Services and Expands its Investigative and Remediation Contracting Capabilities Throughout the Southeastern United States\r\n\r\nSummit Drilling, a leading environmental services contractor announced the addition of South Atlantic Environmental Drilling and Construction Co. Inc. (SAEDACCO) of Fort Mill, South Carolina. Summit provides a wide range of geophysical, drilling and remediation services to the environmental, engineering/construction, utility infr...",
    "fullContent": "The Addition Extends Summit’s Environmental Services and Expands its Investigative and Remediation Contracting Capabilities Throughout the Southeastern United States\r\n\r\nSummit Drilling, a leading environmental services contractor announced the addition of South Atlantic Environmental Drilling and Construction Co. Inc. (SAEDACCO) of Fort Mill, South Carolina. Summit provides a wide range of geophysical, drilling and remediation services to the environmental, engineering/construction, utility infrastructure and aggregate mining industries.\r\n\r\n<em>“We are very excited to welcome SAEDACCO to the Summit team,”</em> states Ron Bucca, Summit Drilling’s President &amp; CEO. <em>“Expanding our capabilities in the Southeast is an important part of our growth strategy. The quality, range of services, and safety culture at SAEDACCO is synergistic with us. You couldn’t draw it up any better. We look forward to locking arms with the leaders at SAEDACCO and continuing our efforts to provide our customers and employees an exceptional experience.”</em>\r\n\r\nSAEDACCO specializes in providing direct push, drilling, including roto-sonic, construction, and remediation services. Founded in 1993, the company has established itself as a leading contractor to the environmental and engineering consulting industry throughout the Southeastern United States.\r\n\r\nThe addition of SAEDACCO extends Summit’s industry leading sonic drilling capability from Massachusetts, along the east coast to Georgia and west to Tennessee and Alabama. It also expands their direct push fleet, auger and rotary drilling services and further strengthens their site remediation capabilities. SAEDACCO brings years of experience in remediation systems installation and fabrication, such as groundwater treatment, soil vapor extraction, air sparging, carbon/media filtration systems, subsurface injection, and vapor intrusion mitigation services. They also provide excavation, transportation, and disposal of contaminated soils, sludge, liquids, and USTs across the Southeast.\r\n\r\n<em>“Merging our company with Summit is a great fit for our team and an extraordinary opportunity”</em>, states Pete Byer, President of SAEDACCO. “<em>We share many of the same capabilities and complementary services, that will provide greater experience, availability, and reach for our clients. Our remediation services for example, enable Summit to engage with consultants on larger multifaceted remediation projects up and down the east coast. It’s exciting to be able to add more value to customers through this union and, most importantly, provide additional growth and resources for our employees.”</em>\r\n\r\nThe addition of SAEDACCO is the 4th for Summit since Q4 2022. Summit acquired TPI Environmental of Easton, PA in November 2022. They added Subsurface Environmental Technologies (SET) and the Hill Environmental Group in January 2023.\r\n\r\nWith this combined capability, Summit is now the leading provider of geophysical services, such as subsurface utility detection and infrastructure locating, in the eastern U.S. They lead the industry in environmental and geotechnical drilling and are the <em>“go-to”</em> source for roto-sonic drilling technology. Each advancement of Summit’s strategic plan creates new alternatives, benefits and opportunities for environmental consulting and site remediation professionals.\r\n\r\nThe acquisition was managed by Will Grindell of Brass Ring Capital and Jeff Reamer of DVG Partners. According to Mr. Grindell and Mr. Reamer, the addition of SAEDACCO is a big step forward in Summit’s methodical, client focused strategic plan.",
    "slug": "summit-drilling-welcomes-south-atlantic-environmental-drilling-and-construction-co-saedacco-to-the-team",
    "date": "2023-05-24 07:37:22",
    "thumbnailId": "1403",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2023/05/1-Summit-SAEDACCO-Art-Withheader.gif"
  },
  {
    "id": "1321",
    "title": "Summit Drilling Acquires Subsurface Environmental Technologies and Hill Environmental Group Strengthening Its Turn-Key Solutions",
    "content": "Summit Drilling, the leading environmental drilling contractor on the East Coast, announced the acquisition of Subsurface Environmental Technologies (SET) and Hill Environmental Group (Hill) effectively strengthening their contractor capabilities and commitment to LSRPs and the environmental consulting community.\r\n\r\nSET and Hill, based in Bordentown, NJ, have decades of environmental contracting experience. They are highly regarded professionals with specific expertise in drilling, geophysics, a...",
    "fullContent": "Summit Drilling, the leading environmental drilling contractor on the East Coast, announced the acquisition of Subsurface Environmental Technologies (SET) and Hill Environmental Group (Hill) effectively strengthening their contractor capabilities and commitment to LSRPs and the environmental consulting community.\r\n\r\nSET and Hill, based in Bordentown, NJ, have decades of environmental contracting experience. They are highly regarded professionals with specific expertise in drilling, geophysics, and remediation technologies. Their combined services represent a formidable capability providing environmental consultants with a “site investigation to site remediation” solution. This acquisition and merged capabilities not only increase Summit’s drilling and remediation capacity, but also adds new services, such as remediation systems<span style=\"text-decoration: line-through;\">,</span> installation and implementation, and UST removal – offering environmental consultants a true turnkey solution. With the recent acquisition of TPI Environmental of Easton, PA Summit is the region’s largest provider of geophysical services. The Geophysics Division is staffed by geophysicists, degreed geologists, environmental scientists, and a PhD Senior Geophysicist assuring clients receive the most reliable technical expertise.\r\n\r\n<em>“We are excited about these additions to our team,”</em> states Ron Bucca, Summit’s President, and CEO. <em>“The addition of SET and Hill amplifies our position as a value-add contractor.</em> <em>Our expanding capabilities increase our ability to provide an ease of service for our customers. As a whole, we are solutions focused internally and can help LSRPs address more complex needs as an integrated service. This will result in increased efficiency and competitiveness for our customers,”</em> concludes Mr. Bucca.\r\n\r\nWith over 35 years of environmental drilling experience from New England to the Southeast, LSRPs count on Summit’s project managers for support on approach and completion of complex scopes of work. Adding Joel Bernstein of SET and Jody Hill of Hill Environmental, along with their talented and experienced team of remediation and geophysics experts, widen Summit’s ability to provide subject matter expertise within their ever-expanding services platform.\r\n\r\n<em>“I have always planned to expand our operations geographically,”</em> states Joel Bernstein, President of SET. <em>“We are licensed to drill in multiple states and provide a large team of professional geophysicists and licensed drillers operating throughout the northeast. Combining this with Summit’s deep bench of talented field personnel and high-tech drilling equipment, such as sonic, there is no limit to our growth,”</em> concludes Mr. Bernstein.\r\n\r\nSummit, SET and Hill also share a health and safety-first culture. Each company is well credentialed with regard to certifications, drilling licenses, and numerous industry-specific trainings, such as New Jersey Transit, Delaware Valley Refinery Training, and API Passport Safety Training, just to name a few.\r\n\r\n<em> </em><em>“I’m excited about this union and opportunity,”</em> states Jody Hill, President of Hill Environmental Group. <em>“We believe that connecting our site assessment technology, geophysics, and remediation experience with Summit’s unequalled drilling services is a natural fit. Our customers can now address more complex site-specific requirements with a single contractor,” </em>continues Ms. Hill.<em> This will make projects easier for our clients. It’s one phone call, one point of accountability, and far easier to coordinate logistically. We can now reduce multiple project phase schedules into one cohesive plan seamlessly.</em> <em>This merger will prove to be of great value to our customers,”</em> concludes Ms. Hill.\r\n\r\nThe acquisition was managed by Will Grindell of Brass Ring Capital and Jeff Reamer of DVG Partners. According to Mr. Grindell and Mr. Reamer, this acquisition is a continuation of Summit’s methodical, client focused strategic plan.\r\n\r\n&nbsp;\r\n\r\n<strong> </strong>",
    "slug": "summit-drilling-acquires-subsurface-environmental-technologies-and-hill-environmental-group-strengthening-its-turn-key-solutions",
    "date": "2023-01-30 14:37:38",
    "thumbnailId": "1323",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2023/01/Summit-Services-2-Web.gif"
  },
  {
    "id": "1312",
    "title": "Summit Drilling Acquires TPI Environmental Expanding Services and Geographic Footprint in the Lehigh Valley Area",
    "content": "<p class=\"p1\">Summit Drilling, a leading drilling contractor announced the acquisition of TPI Environmental. Summit provides a wide range of drilling services to the environmental, engineering/construction, utility infrastructure and aggregate mining industries.<span class=\"Apple-converted-space\"> </span></p>\r\n<p class=\"p1\"><i>“We are very excited about TPI and increasing our ability to more effectively service customers in a quicker manner,”</i> states Ron Bucca, President &amp; CEO of Summit D...",
    "fullContent": "<p class=\"p1\">Summit Drilling, a leading drilling contractor announced the acquisition of TPI Environmental. Summit provides a wide range of drilling services to the environmental, engineering/construction, utility infrastructure and aggregate mining industries.<span class=\"Apple-converted-space\"> </span></p>\r\n<p class=\"p1\"><i>“We are very excited about TPI and increasing our ability to more effectively service customers in a quicker manner,”</i> states Ron Bucca, President &amp; CEO of Summit Drilling. <i>“Geographic expansion is a big part of our growth strategy. Through this acquisition, we are not only expanding our services footprint, but we are also adding services that are natural extensions of our drilling technologies. For example, </i>Mr. Bucca continues<i>, the geophysics team and drillers at TPI are subject matter experts. This enables us to internalize the service and support customers with valuable approach recommendations. The team, services, and organizational culture at TPI are a great fit for us. Together, we are a stronger and more valuable contractor for customers in this region,”</i> concludes Mr. Bucca.<span class=\"Apple-converted-space\"> </span></p>\r\n<p class=\"p1\">TPI Environmental of Easton, PA., provides drilling, utility locating geophysics and remedial injection services to similar industries for over 25-years. Their large fleet of GeoProbes® and remedial injection capabilities will bolster and compliment Summit’s current services, while adding geophysics, such as ground penetrating radar, line locating and magnifying electron microscopes (EM) to Summit’s list of internal capabilities.<span class=\"Apple-converted-space\"> </span></p>\r\n<p class=\"p1\"><i>“Joining the Summit family of companies is a great opportunity for us and for our customers,” </i>states Frank Fendler, President of TPI Environmental. <i>“We have built a great reputation here and can now offer more value through Summit’s extensive drilling technology and talented field teams. Their drilling technology, such as sonic, enables us to deliver a broader range of capability to customers while creating new career growth opportunities for our people. The future looks very bright,”</i> concludes Mr. Fendler.</p>\r\n<p class=\"p1\">The acquisition was managed by Brass Ring Capitol of Minnesota. According to William Grindell, Brass Ring Capitol’s managing director, the synergies between both companies are ideal, well aligned, and directionally consistent with Summit’s growth strategy.<span class=\"Apple-converted-space\"> </span></p>",
    "slug": "summit-drilling-acquires-tpi-environmental-expanding-services-and-geographic-footprint-in-the-lehigh-valley-area",
    "date": "2022-11-04 10:43:02",
    "thumbnailId": "1313",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2022/11/Summit-Acquires-TPI-Web.jpg"
  },
  {
    "id": "1165",
    "title": "Ron Bucca Promoted to Chief Executive Officer as Summit Drilling Fortifies Its Expansion Strategy",
    "content": "Bridgewater, NJ – December 14, 2021, Summit Drilling, a leading environmental and geotechnical drilling services provider, is pleased to announce that its President and COO, Ron Bucca, will expand his role as the company’s new Chief Executive Officer effective January 1, 2022.\r\n\r\n<em>“This is the natural progression of our growth strategy,” </em>states Robert R. Kreilick, Jr., Summit Drilling’s CEO since 1986. <em>“After 35 years I’m proud of the company we’ve built and humbled by the amazing pe...",
    "fullContent": "Bridgewater, NJ – December 14, 2021, Summit Drilling, a leading environmental and geotechnical drilling services provider, is pleased to announce that its President and COO, Ron Bucca, will expand his role as the company’s new Chief Executive Officer effective January 1, 2022.\r\n\r\n<em>“This is the natural progression of our growth strategy,” </em>states Robert R. Kreilick, Jr., Summit Drilling’s CEO since 1986. <em>“After 35 years I’m proud of the company we’ve built and humbled by the amazing people I’ve had the privilege of working with. There are no words to adequately express my gratitude to them. I have tremendous confidence in Ron’s focused leadership, strategic vision, exceptional operational talent, and ability to take Summit to the next level. I look forward to working with him and our investment partners at Brass Ring Capital, Annapolis, DVG and serving on our Board of Directors. Summit is in a very strong position. With Ron at the helm, the future for Summit looks very bright,”</em> concludes Mr. Kreilick.\r\n\r\nRon Bucca has nearly two decades of cross-functional leadership experience in both the private and public sectors. Ron has a proven track record of value creation in multiple private equity backed businesses.\r\n\r\n<em>“Last April, we introduced our institutional investor partners and announced the recapitalization of the company,”</em> states Ron Bucca. <em>“In a very short period, we’ve refined many of our critical processes to increase our communication and value to customers. Simultaneously, we’re investing in our operational foundation to support aggressive growth. I feel fortunate to have Bob’s continued mentorship, inherited an incredible team, extraordinary field talent, and exceptional customers, many of which are decades long relationships.”</em> Mr. Bucca continues<em>. “We value them all and look forward to expanding our geographic footprint and earning the trust of many more. Our ongoing commitment to provide “An Exceptional Experience” will ensure that we do.”</em>\r\n\r\nRon Bucca currently serves in the US Army National Guard and has multiple combat deployments to the Middle East and Africa. He received his bachelor’s degree in Finance from Tulane University, a master’s from Dartmouth, and his MBA from Columbia Business School as a Pat Tillman Foundation Scholar.",
    "slug": "ron-bucca-promoted-to-chief-executive-officer-as-summit-drilling-fortifies-its-expansion-strategy",
    "date": "2021-12-13 14:11:13",
    "thumbnailId": "1164",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2021/12/Bob-Ron-Team-Image.jpg"
  },
  {
    "id": "1059",
    "title": "Summit Drilling Takes on Partners to Support Aggressive Growth",
    "content": "<em><strong>Summit Drilling, a leading provider of environmental drilling services, announced today that it has partnered with a group of strategically aligned investors to recapitalize the business.</strong></em>\r\n\r\nThrough this transaction Summit will be gaining access to the capital and resources required to grow and continue to meet evolving customer needs. The move signals Summit’s confidence that major growth opportunities exist in the environmental drilling sector.\r\n\r\n“This partnership wi...",
    "fullContent": "<em><strong>Summit Drilling, a leading provider of environmental drilling services, announced today that it has partnered with a group of strategically aligned investors to recapitalize the business.</strong></em>\r\n\r\nThrough this transaction Summit will be gaining access to the capital and resources required to grow and continue to meet evolving customer needs. The move signals Summit’s confidence that major growth opportunities exist in the environmental drilling sector.\r\n\r\n“This partnership will enable us to accelerate many aspects of our strategic plan,” states Robert Kreilick Jr., President and CEO of Summit Drilling. “As the industry’s leading provider of sonic drilling technology in the northeast, we plan to bolster our investment in sonic technology and significantly expand our service footprint. We are excited to forge ahead with this new partnership and grateful to have the opportunity to extend Summit’s exceptional experience to a larger number of customers for years to come.”\r\n\r\nSummit Drilling has grown steadily since 1986 and offers a diverse set of drilling solutions including roto-sonic, direct push Geoprobe®, air rotary, mud rotary and hollow stem auger. The company is well-regarded by customers for their dedicated health and safety culture and has successfully supported some of the world’s largest environmental engineering firms.\r\n\r\n“We see very promising opportunities for Summit to expand their geographic footprint and service offering,” states Will Grindell, Managing Director at Brass Ring Capital. “The environmental industry and the talented consultants who work to remediate contaminated sites should benefit greatly from having experienced contractors like Summit who can deliver more comprehensive services to the field.”\r\n\r\n“We are excited to partner with Summit,” states Jeff Reamer, Managing Partner at DVG Partners. “Bob Kreilick and his team have built a remarkably strong company with deep technical expertise, a customer centric focus, best in class fleet department, and a relentless focus on safety. We know that there is strong demand for environmental drilling and believe that Summit is well-positioned to continue to grow.”",
    "slug": "summit-drilling-takes-on-partners-to-support-aggressive-growth",
    "date": "2021-04-28 01:33:25",
    "thumbnailId": "1060",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2021/04/Summit-Recapitalization-Image.jpg"
  },
  {
    "id": "1031",
    "title": "Summit and AWT successfully drilled and installed a large injection well field in Hudson County",
    "content": "<h2><strong><em>Leveraging their strengths and complimentary services, AWT Environmental and Summit Drilling clients continue to benefit from high levels of execution and efficiency</em></strong></h2>\r\n<strong>Project Description: </strong>A carefully selected team from Summit Drilling and AWT Environmental Services installed an injection well field that required 33 double cased injection wells at a storage and recycling operation in Hudson County. Surface casings were installed and grouted into...",
    "fullContent": "<h2><strong><em>Leveraging their strengths and complimentary services, AWT Environmental and Summit Drilling clients continue to benefit from high levels of execution and efficiency</em></strong></h2>\r\n<strong>Project Description: </strong>A carefully selected team from Summit Drilling and AWT Environmental Services installed an injection well field that required 33 double cased injection wells at a storage and recycling operation in Hudson County. Surface casings were installed and grouted into a Meadow Mat confining layer. The boreholes were then advanced through the casing to a target depth of approximately 40 ft. bgs. utilizing sonic drilling technology allowing for accurate screened interval placement. Once the target depth was achieved an injection well was installed in each borehole.\r\n\r\n<strong>Recommended Approach: </strong>Senior project managers from both companies consulted the client in determining an approach that would safely mitigate concerns associated with low height clearances to high voltage overhead lines, as well as specific injection well locations on the site.\r\n\r\nSummit and AWT were instrumental in designing the injection well field in collaboration with the environmental consulting firm. Utilizing sonic sampling techniques, all well locations were continuously logged to identify exact injection well screen intervals.\r\n\r\nFor low height clearance areas, mud rotary drilling was utilized as overhead utilities restricted the boom heights of the sonic rigs. Other safety precautions were developed due to a heavily active work site with truck and forklift traffic.\r\n\r\n<strong>Results: </strong>As proposed, the sonic drilling, installation of the well field and subsequent execution of the injection program was completed effectively, efficiently and safely.\r\n\r\n<strong>Stay tuned for more information about this strategic alliance, project reference site data and industry presentations highlighting this new capability.</strong>",
    "slug": "summit-drilling-and-awt-environmental-services-demonstrate-their-site-remediation-capability-providing-their-environmental-consultant-client-with-unequaled-efficiency-and-results-2",
    "date": "2020-04-11 19:01:50",
    "thumbnailId": "1030",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2020/05/Summit-Reference-Site-Kearny.jpg"
  },
  {
    "id": "1020",
    "title": "Summit Drilling and AWT Environmental Services demonstrate their site remediation capability providing their environmental consultant client with unequaled efficiency and results",
    "content": "<strong>Project Description: </strong>Summit Drilling and AWT Environmental Services were awarded a large project requiring the drilling and installation of 72 monitoring and injection wells, a soil vapor extraction system and an air sparge system on a heavily wooded site. A majority of the wells had a target depth of approximately 70 ft. bgs.\r\n\r\n<strong>Recommended Approach: </strong> Unique challenges resulting from the characteristics of the site, made the selection of the Summit/AWT Alliance...",
    "fullContent": "<strong>Project Description: </strong>Summit Drilling and AWT Environmental Services were awarded a large project requiring the drilling and installation of 72 monitoring and injection wells, a soil vapor extraction system and an air sparge system on a heavily wooded site. A majority of the wells had a target depth of approximately 70 ft. bgs.\r\n\r\n<strong>Recommended Approach: </strong> Unique challenges resulting from the characteristics of the site, made the selection of the Summit/AWT Alliance a beneficial decision. Site preparation and clearing was required in order to establish efficient access to the well locations. In addition, 3 feet of surface soil was removed to allow for the installation of the remediation system piping. Utilizing sonic drilling technology, each borehole was continuously logged to identify and properly select exact screen intervals.\r\n\r\nThe site geology consisted of a glacial till with large cobbles and boulders. The selected drilling technology proved to be highly effective in this difficult geologic formation. Adding to the complexity of drilling and subsequent well installation, the remediation system design called for nested well construction. In a highly coordinated effort, drilling was safely and efficiently completed by the Summit/AWT team, enabling the installation of the air sparge and vapor extraction systems.\r\n\r\n<strong>Results: </strong>The original project schedule allowed 42 days for the installation of the well field. The Summit Drilling team completed the drilling scope of work in just 20 days by skillfully managing multiple sonic rigs. Following completion of the installation of the well field, AWT installed the air sparge and vapor extraction systems to customers specifications.\r\n\r\n<strong>Stay tuned for more information about this strategic alliance, project reference site data and industry presentations highlighting this new capability.</strong>",
    "slug": "summit-drilling-and-awt-environmental-services-demonstrate-their-site-remediation-capability-providing-their-environmental-consultant-client-with-unequaled-efficiency-and-results",
    "date": "2020-03-16 10:56:37",
    "thumbnailId": "1026",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2020/03/Summit-AWT-Web-Content-Pg-Montville.jpg"
  },
  {
    "id": "1015",
    "title": "Summit Drilling and AWT Environmental Services have a proven-effective site remediation solution that provides environmental consultants with unequaled efficiency and results",
    "content": "<strong>Project Description: </strong> Summit Drilling and AWT Environmental Services teamed on an in-situ remediation project at a former UST farm and currently active service station. The combined team was contracted to perform the injection of Sodium Persulphate activated with alkaline active Sodium Hydroxide (NaOH) utilizing direct push technology. The scope of work called for four separate injection events each with 9,000lbs of Sodium Persulphate and 1000 gallons of NaOH.\r\n\r\n<strong>Recomme...",
    "fullContent": "<strong>Project Description: </strong> Summit Drilling and AWT Environmental Services teamed on an in-situ remediation project at a former UST farm and currently active service station. The combined team was contracted to perform the injection of Sodium Persulphate activated with alkaline active Sodium Hydroxide (NaOH) utilizing direct push technology. The scope of work called for four separate injection events each with 9,000lbs of Sodium Persulphate and 1000 gallons of NaOH.\r\n\r\n<strong>Recommended Approach: </strong>The benefit of the alliance between Summit and AWT was quickly realized. Project leaders of each team presented a  change of strategy to the client. The proposed revision was to switch from direct push to re-injectable points utilizing sonic drilling technology.\r\n\r\nThis resulted in improved formational connectivity and therefore better delivery – and less time and effort. The change in approach greatly enhanced the safe delivery of the product into the formation. As an active gas station, the team’s approach also dramatically reduced the amount of equipment and footprint required to successfully complete the injection events while handling the large volumes of aggressive remedial chemicals required for each delivery event.\r\n\r\n<strong>Results: </strong> The combined planning and execution of the Summit and AWT team cut the delivery time of the injection events in half. While the original approach allocated ten days per event, the team’s recommended change in strategy enabled the delivery of full volume in just four days per injection event.\r\n\r\n<strong>Stay tuned for more information about this strategic alliance, project reference site data and industry presentations highlighting this new capability.</strong>",
    "slug": "summit-drilling-and-awt-environmental-services-have-a-proven-effective-site-remediation-solution-that-provides-environmental-consultants-with-unequaled-efficiency-and-results",
    "date": "2020-01-28 11:36:46",
    "thumbnailId": "1014",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2020/01/Summit-Project-Hamilton.jpg"
  },
  {
    "id": "1006",
    "title": "Two Industry Leaders Strengthen Their Alliance and Capability",
    "content": "<h2><em>AWT Environmental Services and Summit Drilling have a proven-effective site remediation solution that provides environmental consultants with unequaled efficiency and results</em></h2>\r\nA lot of teams look good on paper, but when tested in the field can fall short of expectations. That’s exactly why AWT and Summit took the time necessary to validate their performance. From operational alignment and costing, to field services and safety, this alliance has tested their teams on several pro...",
    "fullContent": "<h2><em>AWT Environmental Services and Summit Drilling have a proven-effective site remediation solution that provides environmental consultants with unequaled efficiency and results</em></h2>\r\nA lot of teams look good on paper, but when tested in the field can fall short of expectations. That’s exactly why AWT and Summit took the time necessary to validate their performance. From operational alignment and costing, to field services and safety, this alliance has tested their teams on several projects with very exciting results.\r\n\r\n<em>“This was no flash-in-the-pan idea,”</em> states Pete Postorino, President of AWT Environmental Services. <em>“Our company has worked hard for many years to establish the capabilities we have and the trust we’ve earned from our customers. So, evaluating our business culture and behaviors for alignment with Summit was just as important as the high-level services we can now deliver as a combined solution. I’m very happy to say that we are 100% onboard and believe that this alliance will represent measurable efficiencies for our customers and result in very positive experiences overall,”</em> concludes Mr. Postorino.\r\n\r\nAWT and Summit have demonstrated their teaming approach on several remediation projects in 2019. <em>“Remediation is a contact sport,”</em> states Baxter Duffy, Division Manager of Drilling &amp; In-Situ Injection. <em>“The key to successful remediation lies both in the selection of proper remedial materials and designing the injection program in a manner that contact with the subsurface contaminant is maximized,”</em> adds Mr. Duffy. In each case of the work completed together, they experienced fewer days in the field than anticipated and achieved greater than expected results due to the quality and execution level of each discipline.\r\n\r\nThe services offered by Summit Drilling and AWT Environmental are highly-complimentary but can still be extended to customers individually with no change in how customers work with them today. However, for certain types of remediation requirements, combining the primary strengths of each company is proving to be advantageous for the environmental consultants tasked with accomplishing these sizable projects as efficiently as possible<em>. “We’re encouraged to see the type of results we were getting in the field from a drilling perspective”,</em> states Bob Kreilick, CEO of Summit Drilling. <em>“We’ve been successfully completing complex sites utilizing the latest in sonic technology for a number of years. The confirmation came when we learned that AWT was achieving far greater results due to the quality of the injection wells we were installing. At a time when remediation and site closure efficiency are the priority, it’s clear that our success as a combined team is right on time,”</em> concludes Mr. Kreilick.\r\n\r\n<strong>Stay tuned for more information about this strategic alliance, project reference site data and industry presentations highlighting this new capability.</strong>\r\n\r\n&nbsp;",
    "slug": "two-industry-leaders-strengthen-their-alliance-and-capability",
    "date": "2020-01-21 12:34:39",
    "thumbnailId": "1011",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2020/01/Summit-AWT-Story-Image2.jpg"
  },
  {
    "id": "928",
    "title": "Summit Drilling Knows Its PFAS",
    "content": "Summit Drilling has extensive experience helping environmental consultants to safely and effectively investigate and treat sites with emerging contaminants. With more and more sites requiring characterization for PFAS (per- and polyfluoroalkyl substances) Summit has implemented new and proven-effective drilling methods to avoid cross-contamination of samples from drilling materials, sampling equipment, such as packers, pumps, valves and transducers– even personal protective equipment. Summit’s o...",
    "fullContent": "Summit Drilling has extensive experience helping environmental consultants to safely and effectively investigate and treat sites with emerging contaminants. With more and more sites requiring characterization for PFAS (per- and polyfluoroalkyl substances) Summit has implemented new and proven-effective drilling methods to avoid cross-contamination of samples from drilling materials, sampling equipment, such as packers, pumps, valves and transducers– even personal protective equipment. Summit’s operating procedures are consistent with best practices detailed in the National Ground Water Association’s comprehensive guidance document, <a href=\"http://www.ngwa.org/Media-Center/press/2018/Pages/2018-1-04-PFAs-Guidance-Document-Announcement.aspx\"><em>Groundwater and PFAS: State of Knowledge and Practice</em></a>\r\n\r\n<em>“There are unique standards for this type of work</em>, states Tory Donnelly, President and COO of Summit Drilling. <em>“Due to the very low reporting limits associated with PFAS, special precautions must be taken</em> <em>in preparation and materials use to avoid cross contamination. We have executed flawlessly on multiple large-scale military projects with PFAS as the primary concern”, </em>continues Donnelly<em>. “I’m very proud of our project managers and expertly trained field teams who have demonstrated their ability to successfully address sites affected by this emerging contaminant”, </em>Donnelly concludes<em>. </em>\r\n\r\n<strong>For information on Summit Drilling’s unique capabilities, visit </strong><a href=\"http://localhost:10140\"><strong>www.summitdrilling.com</strong></a>\r\n\r\n<strong>To speak with a veteran project manager about investigating or treating a site with emerging contaminants, call 800-242-6648. </strong>",
    "slug": "summit-drilling-knows-its-pfas",
    "date": "2018-04-18 11:24:20",
    "thumbnailId": "930",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2018/04/PFAS-Story-Image.jpg"
  },
  {
    "id": "894",
    "title": "Summit introduces the latest addition to it’s expanding sonic fleet – the BL-50, the industry’s most powerful 50K sonic rig",
    "content": "The BL-50 sonic head puts out 50,000 lbs. of force, 7,000 lbs. of rotational torque and has 0-90 degree tilt capacity. Coupled with Summit’s expertly trained drillers, consultants can expect absolute precision, highly efficient footage advancement, uncompromised sample quality and above all – safety.\r\n\r\n<em>“Our new truck mounted BL-50 is the most advanced Sonic drill on the market,</em> states Tory Donnelly, president, and COO. <em>“With innovative designs and patented technologies, it’s a perf...",
    "fullContent": "The BL-50 sonic head puts out 50,000 lbs. of force, 7,000 lbs. of rotational torque and has 0-90 degree tilt capacity. Coupled with Summit’s expertly trained drillers, consultants can expect absolute precision, highly efficient footage advancement, uncompromised sample quality and above all – safety.\r\n\r\n<em>“Our new truck mounted BL-50 is the most advanced Sonic drill on the market,</em> states Tory Donnelly, president, and COO. <em>“With innovative designs and patented technologies, it’s a perfect compliment to our limited access MRS-50 sonic crawler.”\r\n</em>\r\nSummit’s BL-50 and highly-experienced drillers take on sand, gravel, cobbles, boulders or bedrock – no problem! Get detailed specifications on our new BL-50, as well as all of our equipment fleet on our <a href=\"http://localhost:10140/services/equipment-roster/\"><u>Equipment Roster</u></a>.\r\n\r\nExperience the Sonic difference with Summit. Call 800-242-6648 to speak with one of our veteran project managers. Need a Project Proposal? Click <a href=\"http://localhost:10140/resources/start-a-project/\"><u>Start-A-Project</u></a> and upload your Scope of Work. In most cases, we’ll have an estimate back to you within 24 hours or less.",
    "slug": "summit-introducing-the-latest-addition-to-its-expanding-sonic-fleet-the-bl-50-the-industrys-most-powerful-50k-sonic-rig",
    "date": "2017-08-18 14:15:49",
    "thumbnailId": "896",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2017/08/BL-50-NewsBrief-Photo.jpg"
  },
  {
    "id": "846",
    "title": "Summit Drilling Finds Veterans to be Important Asset for Company",
    "content": "Summit Drilling provides environmental consultants and engineering firms with a wide platform of drilling and injection services. From the drilling and installation of monitoring wells that enable subsurface investigation of ground water, to geotechnical soil borings that confirm bedrock in a broad range of geologies, Summit relies most on it’s greatest asset – it’s people.\r\n\r\n<strong>Like many aspects of military operations, it can be very tough work that requires specially trained teams to ope...",
    "fullContent": "Summit Drilling provides environmental consultants and engineering firms with a wide platform of drilling and injection services. From the drilling and installation of monitoring wells that enable subsurface investigation of ground water, to geotechnical soil borings that confirm bedrock in a broad range of geologies, Summit relies most on it’s greatest asset – it’s people.\r\n\r\n<strong>Like many aspects of military operations, it can be very tough work that requires specially trained teams to operate highly technical and sophisticated equipment – in conditions that are often difficult. </strong>\r\n\r\nSuccess in the field is dependent on many factors. Training, teamwork, real-time situational analysis, communications, safety, equipment and a personal commitment to doing the job right, are all important factors in accomplishing the objective.\r\n\r\nSummit Drilling has always valued the commitment, training, talent and character associated with our country’s military veterans. They currently employ military veterans representing the Marine Corp., Air Force, Coast Guard and Army/National Guard. Continuing it’s support of veterans, Summit is actively participating with a Veterans Transition Assistance organization named <em>Bridging The Gap</em> to add additional talent to their roster.\r\n\r\n<em>“This unique program is a win-win opportunity”,</em> states Tory Donnelly, president of Summit Drilling. <em>“One of the challenges in our industry is identifying and hiring team members who will thrive in this vocation. The qualities we find in military veterans is congruent with what is needed to perform this type of work successfully”, </em>continues Donnelly. <em>“We look forward to a long and productive relationship with Bridging the Gap and sharing a mission to provide opportunities to the people who have so bravely served our great country.”</em>\r\n\r\nNick DelVecchio, Summit’s Corporate Buyer and former U.S. Marine, added, <em>“You go in at a very young age and grow up there. You</em> <em>come out more mature and with a sense of how to approach things. You have strong attention to detail. You learn to be punctual, accountable and very disciplined ... to have pride in what you do.”</em>\r\n\r\nDenis Crayon, CHST and Director of Health and Safety for Summit Drilling, who served in the U.S. Air Force, summed up how key aspects of his military experience have translated/helped him:\r\n\r\n<strong>Discipline.</strong> First and foremost, this is one of the hardest assets to learn and to develop but indispensable for growing up.\r\n\r\n<strong>Responsibility.</strong> Show up on time and be prepared for the day and tasks ahead.<strong> </strong>\r\n\r\n<strong>Respect.</strong> Show respect to superiors and team members. Disrespect was not tolerated. No individual is greater than the team.\r\n\r\n<strong>Training.</strong> On-the-job training-to become proficient in my job. Being trained by those who came before me was all-important and showed the need for continuity in any operation.\r\n\r\n<strong>Recognition.</strong> Everyone likes to be recognized for a job well done. It can oftentimes provide motivation when money can’t be offered.\r\n\r\n<strong>Accountability.</strong> No excuses. You’re trained what to do, how to do it, provided with the tools and equipment to perform, and an expected timeline to complete.<strong> </strong>\r\n\r\n<strong>Mission.</strong> Having a mission provided focus for all involved and brought about camaraderie. Knowing the roles others played toward mission accomplishment was all-important.\r\n\r\n<em>Bridging the Gap</em> is veteran owned, 503 (c)(3) non-profit that has built a very effective process for helping military vets integrate into a civilian workforce. Their system works in partnership with vet friendly employers and has proven to be more effective than veterans searching through traditional and highly competitive job postings, staffing companies, newspaper ads and job fairs.",
    "slug": "summit-drilling-finds-veterans-to-be-important-asset-for-company",
    "date": "2017-04-20 15:02:02",
    "thumbnailId": "863",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2017/04/Summmit-Vets-2.jpg"
  },
  {
    "id": "833",
    "title": "Summit Drilling Achieves The Gold Standard for Safety",
    "content": "<h2><em>The Gold Shovel Certification Committee has recently notified Summit Drilling of their approved Gold Shovel Standard Certification</em></h2>\r\n\r\nGold Shovel Standard (GSS) is a nonprofit organization that provides third-party confirmation of baseline Safety Management Systems for the protection of buried assets, and a fair and transparent metric for damage prevention. A company that is <strong>Gold Shovel Standard Certified</strong> has policies and procedures, which, if followed, make it...",
    "fullContent": "<h2><em>The Gold Shovel Certification Committee has recently notified Summit Drilling of their approved Gold Shovel Standard Certification</em></h2>\r\n\r\nGold Shovel Standard (GSS) is a nonprofit organization that provides third-party confirmation of baseline Safety Management Systems for the protection of buried assets, and a fair and transparent metric for damage prevention. A company that is <strong>Gold Shovel Standard Certified</strong> has policies and procedures, which, if followed, make it unlikely that the company will cause at-fault damage to buried infrastructure. <em>Gold Shovel Standard certified organizations are recognized to be Best-in-Class</em>.\r\n\r\n<em>“We are very proud to have been approved by the Gold Shovel Certification Committee”,</em> states Tory Donnelly, President of Summit Drilling. <em>“Qualifying for this program further demonstrates our ongoing commitment to Health and Safety. The well-being of our field teams is paramount, so additional processes and metrics can only improve our already rigorous programs”, </em>concludes Donnelly<em>. </em>\r\n\r\nGold Shovel Standard provides two very basic services for industry. First, it provides third-party confirmation of an in-place Safety Management System (SMS) for the protection of buried assets<em>. </em>And second, it represents an ambitious effort driven by industry to create fair and transparent metrics for damage prevention similar to other safety metrics (LTIR, EMR, TRIR, DART, etc.)\r\n\r\nThis program confirms the adequacy of the participant’s policies and procedures, and produces a rating, known as an EICO™ score, short for “Excavation Incident Calculated Occurrence” which is a measure of how carefully a company excavates around buried infrastructure.\r\n\r\nThe EICO Score was created to address a gap in the general knowledge about how carefully or carelessly companies excavate around buried infrastructure. One way to think about EICO Scores is by drawing a parallel to general safety ratings. Over the last decade, what was considered acceptable performance in the safety arena has steadily increased, and now all contractors must be attentive to safety of their workforce.\r\n\r\n<em>“The timing for this certification is ideal”, </em>states Summit’s CEO, Robert Kreilick, Jr.<em> “We’re seeing an increase in health and safety requirements across a wider span of industry segments. As infrastructure spending accelerates, companies that have made the investments proactively, as Summit has, will be in an excellent position to address the growing needs of their environmental and geotechnical clients. Adding this layer of reporting and transparency, </em>continues Mr. Kreilick<em>, will only deepen the trust our clients currently extend. </em>\r\n\r\nOver the next decade, the Gold Shovel Standard will be used to first measure the performance of companies and then slowly ratchet up the expectation of how carefully a company must be when excavating around buried infrastructure.\r\n\r\nSummit Drilling provides a wide range of environmental and geotechnical services throughout the Eastern US, from Vermont to Georgia, including sonic, air rotary, hollow stem auger, mud rotary, direct push and injection services. In addition to their industry-leading field services teams, Summit Drilling has been honored for the seventh consecutive year with the Governor’s Annual Occupational Safety &amp; Health Award. For more information about Summit Drilling services, or attending a Health &amp; Safety meeting, call <a href=\"tel:+18002426648\" onclick=\"ga('send', 'event', 'call', 'link', 'news');\">800-242-6648</a>. To submit an online request for proposal, click <strong><em>“<a href=\"http://localhost:10140/resources/start-a-project/\"><u>Start A Project</u></a>”</em></strong>.\r\n\r\n<img src=\"/images/news/gold-standard-2.jpg\" alt=\"Summit Drilling Gold Standard Safety\" width=\"617\" height=\"405\" class=\"alignnone size-full\" style=\"margin:0px;\" />",
    "slug": "summit-drilling-achieves-the-gold-standard-for-safety",
    "date": "2017-03-15 10:38:21",
    "thumbnailId": "838",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2017/03/gold-standard-1.jpg"
  },
  {
    "id": "761",
    "title": "Leading Environmental Driller Fortifies Support of Mid Atlantic Region",
    "content": "<h2><em>Summit Drilling expands its capability to provide environmental consultants efficient, highly effective and safety-focused services</em></h2>\r\n<p><em>[Pictured] Summit’s Vice President of Operations - Runnemede, Joan Baer stands with Ron Barber, Drilling Superintendent in the new and expansive Runnemede, NJ office.</em></p>\r\n<h2>Summit Drilling, one of the Northeast’s largest environmental drilling and injection services companies, has moved it’s southern New Jersey operations to a new...",
    "fullContent": "<h2><em>Summit Drilling expands its capability to provide environmental consultants efficient, highly effective and safety-focused services</em></h2>\r\n<p><em>[Pictured] Summit’s Vice President of Operations - Runnemede, Joan Baer stands with Ron Barber, Drilling Superintendent in the new and expansive Runnemede, NJ office.</em></p>\r\n<h2>Summit Drilling, one of the Northeast’s largest environmental drilling and injection services companies, has moved it’s southern New Jersey operations to a new state-of-the-art 15,000 sq. ft. facility in Runnemede, NJ.</h2>\r\n<em>“This move is significant for us”,</em> states Tory Donnelly, President &amp; COO of Summit Drilling<em>. “We have dramatically increased our ability to service consultants in and around the Mid-Atlantic Region</em>. <em>This new facility has a dedicated health and safety training room, an expansive inventory area, and a fully equipped fleet maintenance shop. This enables us to reinforce and sustain our culture of safety while providing our customers with unsurpassed uptime on a full range of drilling and injection technologies”.</em><strong>\r\n</strong>\r\nSummit’s new Runnemede facility features eight administrative and project management offices, a conference room, a secure exterior storage area for tooling and equipment, and a very large fleet depot area. According to Vice President, Joan Baer, the new facility advantages are many. <em>“We are thrilled to have this new space. Our location is just off the NJ Turnpike and Route 295 making interstate mobilization very efficient. It’s also convenient for visiting customers”, </em>Ms. Baer continues. <em>“They value the Lunch &amp; Learns we present, especially to their younger field personnel and project managers of which many have not experienced solutions like Roto-Sonic drilling in the field.</em> <em>We can also provide customers with on-site demos, host events and invite consultants to one of our weekly health and safety meetings.” </em>adds Ms. Baer.\r\n\r\nWith a shared enthusiasm, Summit’s Drilling Superintendent, Ron Barber, echoed Ms. Baer’s comments on process efficiency and added that the size and organization of the new facility supports all of Summit’s drilling technologies, including sonic, air rotary, hollow stem auger, mud rotary and direct push sampling. Mr. Barber stated that they are even providing utility clearance services via vacuum excavation and air knifing as a stand-a-lone service for consultants who need support one phase at a time.\r\n\r\nAcross the whole organization, people at Summit will tell you that these changes are all part of their ongoing plan. <em>“This move is another example of Summit’s on-going commitment to creating an infrastructure that can support operational excellence”, </em>states Robert Kreilick, Jr., CEO<em>. “It also reinforces our platform for long-term growth while we make significant investments in technology and strengthening our market coverage”.</em>\r\n\r\nThe company is dedicated to its people, safety and leading technology. Individually and collectively, they are committed to their customer promise of an <em>exceptional experience</em>.",
    "slug": "leading-environmental-driller-fortifies-support-of-mid-atlantic-region",
    "date": "2016-03-03 14:21:38",
    "thumbnailId": "758",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2016/03/Joan-Baer__Ron-Barber.jpg"
  },
  {
    "id": "1",
    "title": "The Northeast's Fastest Growing Environmental Driller Names A New Leader",
    "content": "<h2><em>Tory Donnelly Takes the Reins as President of Summit Drilling</em></h2>\r\n&nbsp;\r\n<h2>Summit's new President, Tory Donnelly stands side by side with company CEO Robert R. Kreilick, Jr.</h2>\r\nSummit Drilling, an industry leading environmental drilling and remedial injection services company, announced today that Tory Donnelly, the company's Executive Vice President &amp; COO, has been named President.\r\n\r\nThis planned move signals another significant step forward in Summit's strategic growt...",
    "fullContent": "<h2><em>Tory Donnelly Takes the Reins as President of Summit Drilling</em></h2>\r\n&nbsp;\r\n<h2>Summit's new President, Tory Donnelly stands side by side with company CEO Robert R. Kreilick, Jr.</h2>\r\nSummit Drilling, an industry leading environmental drilling and remedial injection services company, announced today that Tory Donnelly, the company's Executive Vice President &amp; COO, has been named President.\r\n\r\nThis planned move signals another significant step forward in Summit's strategic growth according to Robert R. Kreilick, Jr., Summit's Chief Executive Officer. <em>\"Our business strategy remains customer focused,\" </em>states Mr. Kreilick <em>. \"We have invested in industry-leading technology, achieved an unwavering culture of safety, added the highest quality team members in the business, and expanded our territory geographically. With three decades of successful growth as our foundation, this milestone will allow us to pursue acquisitions, regional expansion and continued growth.\"</em>\r\n\r\nMs. Donnelly will be responsible for overseeing all of Summit Drilling operations, a company approaching its 30<span style=\"font-size: 12.5px; line-height: 18.75px;\">th</span> anniversary that has doubled in size since her arrival in 2009. <em>\"I am looking forward to the challenge of continuing the growth of the organization\"</em>, states Ms. Donnelly. <em>\"The obligation I now have to our clients and our employees humbles me, but also drives me to ensure that we deliver on our Exceptional Experience promise to customers. </em><em>We will press on with our plan and provide new opportunities across our entire organization. Most importantly, our ongoing efforts will maintain the high level of performance and service our customers count on and experience today as we continue to grow\", </em>concludes Ms. Donnelly<em>.</em>\r\n\r\nBefore joining Summit Drilling, Ms. Donnelly was a 20-year veteran of environmental consulting. As a consultant, she managed major petroleum accounts and established herself as a champion of health &amp; safety. Leveraging this experience, Ms. Donnelly brought valuable insights that helped Summit align operationally and fortify the exceptional levels of customer service the company has been known for.\r\n\r\n<em>\"Throughout Tory's previous position as executive vice president &amp; COO, she has made enormous contributions to Summit's goals and growth\", </em>adds Mr. Kreilick <em>. \"Tory has proved herself as a highly capable and insightful leader. Her results-oriented approach to delivering exceptional service to our customers will play a pivotal role in expanding our market share. I am confident that Tory's ongoing dedication and vision will ensure Summit's continued momentum as we execute our strategic plan\" </em>, concludes Mr. Kreilick.",
    "slug": "the-northeasts-fastest-growing-environmental-driller-names-a-new-leader",
    "date": "2015-11-12 20:03:36",
    "thumbnailId": "680",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/11/Bob_Kreilick__Tory_Donnelly-New.jpg"
  },
  {
    "id": "544",
    "title": "Summit Drilling Opens Regional Office in Albany",
    "content": "Drilling leader's strategic growth supports environmental projects centered in New York's Capital Region.\r\n\r\nSummit Drilling has taken another step on their strategic path of regional expansion by opening a new office in Albany, New York. The Northeast's largest and fastest growing drilling and injection services company now supports 3 regional offices in addition to its headquarters in Bridgewater, NJ. This expands Summit's reach north and south from Massachusetts to Washington, DC and West to ...",
    "fullContent": "Drilling leader's strategic growth supports environmental projects centered in New York's Capital Region.\r\n\r\nSummit Drilling has taken another step on their strategic path of regional expansion by opening a new office in Albany, New York. The Northeast's largest and fastest growing drilling and injection services company now supports 3 regional offices in addition to its headquarters in Bridgewater, NJ. This expands Summit's reach north and south from Massachusetts to Washington, DC and West to East from Pennsylvania to Long Island, NY.\r\n\r\nAll of the same high performance drilling, direct push and injection services provided at Summit's New Jersey and Pennsylvania offices will be provided in Albany. <em>\"We have a very aggressive growth plan for our operation in the Capital Region\",</em> says Robert Kreilick, Jr., Summit's Chief Executive Officer. <em>\"We have invested in a location near Albany's local airport which is closely aligned with all major highways. This offers our customers extraordinary reach and highly efficient mobilizations. This property is ideal for us with space for significant expansion as more consultants experience our level of performance in the field and overall customer service,\"</em> adds Mr. Kreilick.\r\n\r\nRunning and growing the Albany office has been assigned to Summit's new and highly experienced regional manager, James Stair. James comes to Summit as a licensed driller with over 15 years in the subsurface investigation industry. Since 2010, James has been managing drilling projects in the Albany region providing customers with local experience and specific knowledge of the area and it's unique geology.\r\n\r\n<em>\"I am extremely excited to become a part of the Summit team. It's very rare to find a company that truly believes in teamwork as a core value. That puts safety, employee welfare, and customer service above the bottom line,\"</em> says Mr. Stair.<em> \"To have the opportunity to help bring a successful, professional, proven industry leader to the Capital Region is unbelievable,\"</em> concludes Mr. Stair.\r\n\r\nSummit's new office opened in late March and is already responding to request for proposals.<em> \"We have the utmost confidence in James\", </em>states Tory Donnelly, Summit's President and Chief Operating Officer. <em>\"His background, customer service focus and professional goals are in perfect alignment with ours. We feel very fortunate to have added another quality individual to the Summit team as we forge ahead,\"</em> concludes Ms. Donnelly.\r\n\r\nSummit Drilling is a leading environmental services company offering a full spectrum of drilling services, including: sonic drilling technology, direct push sampling, and remedial injection expertise. For more information about Summit's extensive array of services, or their Governor's Award winning Experience Safety Program, call 800-242-6648.\r\n\r\nSummit is headquartered in Bridgewater, New Jersey, with regional offices in Mount Laurel, NJ, Albany, NY and Warrington, PA.",
    "slug": "summit-drilling-opens-regional-office-in-albany",
    "date": "2015-11-12 19:00:18",
    "thumbnailId": "566",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/11/news-Albany-office.jpg"
  },
  {
    "id": "568",
    "title": "Summit Drilling Achieves 7th Consecutive Governor’s Health & Safety Award",
    "content": "An unwavering culture of safety is at the core of Summit Drilling’s ongoing record of success\r\n\r\nSummit Drilling, one of the Northeast's fastest growing environmental services companies, is once again honored as one of the region's safest operators. Director of Health and Safety, Denis Crayon, accepted a well-deserved Recognition Award at the 2014 Governor's Annual Occupational Safety and Health Awards Program. This award is presented to organizations with an outstanding safety record throughout...",
    "fullContent": "An unwavering culture of safety is at the core of Summit Drilling’s ongoing record of success\r\n\r\nSummit Drilling, one of the Northeast's fastest growing environmental services companies, is once again honored as one of the region's safest operators. Director of Health and Safety, Denis Crayon, accepted a well-deserved Recognition Award at the 2014 Governor's Annual Occupational Safety and Health Awards Program. This award is presented to organizations with an outstanding safety record throughout 2013 and considered a pillar of achievement in the prevention of workplace injury and illness for 86 years.\r\n\r\n\"The Health &amp; Safety program we've developed at Summit Drilling continues to produce extraordinary results. We believe that it has become one of the most recognized in the northeastern region and a model program for environmental contractors\", states Denis Crayon, Summit's Director of Health &amp; Safety. \"Our consistent investment in training and ongoing reinforcement of safe practices has become our corporate culture. The sharing of our progress and statistics with field personnel, our operations team and our clients, has brought a high level of understanding about our program to all stakeholders.\"\r\n\r\nIf you would like to learn more about Summit Drilling's Health &amp; Safety program, it's Loss Prevention System performance, Safety Performance Observations, Near Loss Reporting and Job Safety Analysis, call 800-242-6648 and speak with Denis Crayon. Denis is also the president of Experience Safety Institute, an independent Health &amp; Safety training firm.\r\n\r\nRegular Health &amp; Safety meetings at Summit Drilling are always open to industry colleagues, environmental consultants, engineering firms and contractor/partners supporting the environmental investigation industry. If you would like to attend a weekly meeting, we recommend that you call in advance to register. Thank you.",
    "slug": "summit-drilling-achieves-7th-consecutive-governors-health-safety-award",
    "date": "2015-11-12 18:57:45",
    "thumbnailId": "569",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/11/governors-award-story.png"
  },
  {
    "id": "571",
    "title": "100+ Attend Summit’s Demo on Industry-Leading Sonic Technology",
    "content": "We would like to take a moment to thank all of those who attended our Fall Technology Demonstrations featuring our latest Roto-Sonic drilling technology. Your participation helped make this event one of the best and most attended in our company’s history.\r\n\r\nWe recognize that not every one could break away at this busy time of year, so please<a href=\"http://localhost:10140/services/sonic-drilling-demo/\"> feel free to click through to our demo photos</a> when you have a moment free. Very soon, we...",
    "fullContent": "We would like to take a moment to thank all of those who attended our Fall Technology Demonstrations featuring our latest Roto-Sonic drilling technology. Your participation helped make this event one of the best and most attended in our company’s history.\r\n\r\nWe recognize that not every one could break away at this busy time of year, so please<a href=\"http://localhost:10140/services/sonic-drilling-demo/\"> feel free to click through to our demo photos</a> when you have a moment free. Very soon, we will be sharing a link to view a video of our event.\r\n\r\nSummit Drilling’s Health &amp; Safety presentation provided a comprehensive level of detail and safety performance metrics. Guests were invited to participate in our company’s signing ceremony on \"Summit’s Rules of the Game\" and \"Pledge to Safety\". These are two unique internal programs that are designed to foster and sustain our corporate culture. Next, consultants and industry partners had a close up view of our latest Sonic technology in action. They witnessed very efficient drilling and the extraction of two soil samples from bedrock. Consultants gathered around the samples for a closer look followed by a period of Q&amp;A.\r\n\r\nIt was outstanding to connect with so many clients that we have known for years, as well as many from out of town that we had not met. We were especially appreciative of attendees making the trip from DC, Delaware and Pennsylvania. We feel that it was a testament to the strong interest Sonic technology is driving within the environmental market.\r\n\r\nOnce again, thank you. We hope that you will consider joining us again in 2015!",
    "slug": "100-attend-summits-demo-on-industry-leading-sonic-technology",
    "date": "2015-11-12 17:00:08",
    "thumbnailId": "572",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/11/summit-sonic-demo-story.png"
  },
  {
    "id": "574",
    "title": "1 of 164 in NJ, Summit Drilling makes Inc. 5000 list of the fastest-growing companies",
    "content": "November 2014 — Bridgewater, NJ. Inc. Magazine has released its 2014 Inc. 5000 list of the fastest-growing private companies in America.\r\n\r\nOf the 164 companies qualifying in New Jersey, Summit Drilling ranked 86<sup>th</sup> in gross revenue and achieved a 3-year growth rate of 55%. Summit outpaced 87 other recognized New Jersey companies.\r\n\r\n\"We're extremely proud to be recognized by <strong>Inc.'s Fastest Growing</strong>,\" states Robert R. Kreilick, Jr., CEO of Summit Drilling.\r\n“Although we...",
    "fullContent": "November 2014 — Bridgewater, NJ. Inc. Magazine has released its 2014 Inc. 5000 list of the fastest-growing private companies in America.\r\n\r\nOf the 164 companies qualifying in New Jersey, Summit Drilling ranked 86<sup>th</sup> in gross revenue and achieved a 3-year growth rate of 55%. Summit outpaced 87 other recognized New Jersey companies.\r\n\r\n\"We're extremely proud to be recognized by <strong>Inc.'s Fastest Growing</strong>,\" states Robert R. Kreilick, Jr., CEO of Summit Drilling.\r\n“Although we have a lot more to accomplish moving forward, this is strong validation that we are heading in the right direction. First and foremost, I want to recognize our clients”, Kreilick continues. “They are providing the opportunities for us and with that, we can advance the necessary investments in training, people and equipment to exceed their expectations. We are very excited about this accomplishment but regardless of our growth rate, it is our mission to achieve an ever-increasing level of customer confidence and satisfaction”, Mr. Kreilick concludes.\r\n\r\nNew Jersey was well represented on the list and ranged from No. 32 all the way to No. 4,982. That was good for 11th among states that made the list. This was the 33rd year the magazine has compiled this annual list.",
    "slug": "1-of-164-in-nj-summit-drilling-makes-inc-5000-list-of-the-fastest-growing-companies",
    "date": "2015-11-12 16:01:18",
    "thumbnailId": "575",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/11/inc-500-newsstory-resized.png"
  },
  {
    "id": "577",
    "title": "Summit Drilling Rings In The New Year by Welcoming Another Industry Veteran to the Family",
    "content": "<em>Joan Baer Joins Summit fortifying the Company's Rapidly Growing South Jersey Regional Office</em>\r\n\r\nSummit Drilling has announced the hiring of Joan Baer, a 25-year drilling industry veteran. Ms. Baer comes to Summit Drilling after 15 years as General Manager of another regional drilling company. Her experience there was diverse and included sales &amp; marketing, project management, customer service, human resources development, health &amp; safety, bids, contract negotiation and operation...",
    "fullContent": "<em>Joan Baer Joins Summit fortifying the Company's Rapidly Growing South Jersey Regional Office</em>\r\n\r\nSummit Drilling has announced the hiring of Joan Baer, a 25-year drilling industry veteran. Ms. Baer comes to Summit Drilling after 15 years as General Manager of another regional drilling company. Her experience there was diverse and included sales &amp; marketing, project management, customer service, human resources development, health &amp; safety, bids, contract negotiation and operational budgeting.\r\n\r\n\"<em>I think the addition of Joan will be a tremendous boost for us in terms of customer satisfaction</em>\", adds Rick Davis, Summit's Regional Vice President of Operations - South. \"<em>Joan's accomplishments in the field combined with her experience in operations will provide customers with a highly experienced individual who can discuss technical aspects about our services and equipment while resolving potential challenges in the field effectively. As we continue to grow, this is the type of individual our customers can count on.</em>\"\r\n\r\nPictured left to right: Estimating Manager, Charles Daugherty, Regional Vice President of Operations, Rick Davis and Joan Baer, Sr. Project Manager.\r\n\r\nAs Summit's newest Sr. Project Manager, Ms. Baer brings extraordinary knowledge to Summit Drilling's fast growing South Jersey operation. \"The decision to make a move after 24 years with the same company was difficult. The decision to accept a position with Summit was easy\", offers Ms. Baer. \" Joining Summit Drilling is a fantastic opportunity for me. They are setting new standards for how contractors in the drilling industry operate. The investments they have made in people, equipment and their Health &amp; Safety program is bound to bring great returns to the company, their clients and employees alike. I just like the way they do things\", concludes Ms. Baer.\r\n\r\nIn addition to adding top-notch individuals to their roster, Summit Drilling is also recognizing the talents of existing team members. In the last quarter of 2013, the company promoted Tory Donnelly to Executive Vice President &amp; COO. \"Summit is continuing to grow and change\", offers Ms. Donnelly. \"<em>We began by addressing the tough questions. We wanted to understand from our customer's perspective how to become a better company</em>\", adds Ms. Donnelly. \"<em>All of this hard work is why people like Rick Davis, Dermot Dillon, Jennifer Karen, John Passananti, John Coyle, Bob Hough, Ron Barber, Bill Shinn and so many others here are raising the bar in our industry. The future looks very bright from this view</em>\".",
    "slug": "summit-drilling-rings-in-the-new-year-by-welcoming-another-industry-veteran-to-the-family",
    "date": "2015-11-12 15:02:25",
    "thumbnailId": "578",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/11/joan-company-news.jpg"
  },
  {
    "id": "592",
    "title": "Summit Drilling Increases Its Commitment to Environmental Consultants in Pennsylvania",
    "content": "<em>New office in Warrington, PA offers a full platform of drilling services all supported by Summit's award-winning health &amp; safety program  </em>\r\n\r\nSummit Drilling has taken the next step on their path to regional expansion by opening a new office in Bucks County, Pennsylvania. Last year, Summit absorbed the assets and operations of Tabasco Drilling, a move that strengthened the company's position in Southern New Jersey. Based on the company's strategic plan, the opening of the Warrington...",
    "fullContent": "<em>New office in Warrington, PA offers a full platform of drilling services all supported by Summit's award-winning health &amp; safety program  </em>\r\n\r\nSummit Drilling has taken the next step on their path to regional expansion by opening a new office in Bucks County, Pennsylvania. Last year, Summit absorbed the assets and operations of Tabasco Drilling, a move that strengthened the company's position in Southern New Jersey. Based on the company's strategic plan, the opening of the Warrington, PA office will allow Summit Drilling to advance their initiatives to serve the needs of consultants in new regions.\r\n\r\n<em>“We feel very confident that our expertise, safety record and equipment fleet will address a growing need in Pennsylvania\", </em>says <a href=\"mailto:chris@localhost\">Chris Casarona</a>, Summit Drilling's Director of Sales &amp; Marketing.<em> \"We have an excellent track record from Massachusetts to Maryland and have consistently demonstrated an ability to support our environmental clients from many different regions”, </em>adds Mr. Casarona.\r\n\r\nPictured above: Probe operator Travis Kreilick moves a new 7822DT safely using a wireless remote controller.\r\n\r\nSummit will be providing all of the same drilling, direct push and injection services in Pennsylvania as they do from their headquarters in Bridgewater, NJ and their regional office in Mount Laurel, NJ. <em>\"We hope to grow our operation here steadily\",</em>says Travis Kreilick, Summit's lead operator in the new Warrington, PA office. <em>\"We're anxious to begin developing new relationships and earn the trust of the outstanding consultants in this region\"</em>, adds Mr. Kreilick.\r\n\r\n<strong><em>For A Project Estimate, please contact Charles Daugherty at 800-242-6648, or email <a href=\"mailto:charles@localhost\">Charles@localhost</a></em></strong>",
    "slug": "summit-drilling-increases-its-commitment-to-environmental-consultants-in-pennsylvania",
    "date": "2015-11-12 14:25:33",
    "thumbnailId": "654",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/11/news-pa-rig.jpg"
  },
  {
    "id": "594",
    "title": "Summit Drilling's \"Experience Safety\" Program Recognized Four Years Consecutively and Counting",
    "content": "<em>Consistency and dedication is at the core of any successful Health &amp; Safety Program. At Summit, it's become a corporate culture</em>\r\n\r\nSummit Drilling, one of the Northeast's fastest growing environmental services companies is once again honored as one of the region's safest operators. Director of Health and Safety, Denis Crayon, accepted a well-deserved Recognition Award at the Governor's Annual Occupational Safety and Health Awards Program. This award is presented to organizations wit...",
    "fullContent": "<em>Consistency and dedication is at the core of any successful Health &amp; Safety Program. At Summit, it's become a corporate culture</em>\r\n\r\nSummit Drilling, one of the Northeast's fastest growing environmental services companies is once again honored as one of the region's safest operators. Director of Health and Safety, Denis Crayon, accepted a well-deserved Recognition Award at the Governor's Annual Occupational Safety and Health Awards Program. This award is presented to organizations with an outstanding safety record throughout 2012 and considered a pillar of achievement in the prevention of workplace injury and illness for 85 years. The New Jersey Department of Labor and Workforce Development, the New Jersey State Industrial Safety Committee and the New Jersey State Safety Council sponsor this important program.\r\n\r\n&nbsp;\r\n<div id=\"bd\">\r\n<div id=\"bd-inner\" class=\"clearfix\">\r\n<div class=\"col-layout-b clearfix\">\r\n<div class=\"main\">\r\n\r\nPictured: Members of the Summit Drilling team with representatives and presenters at the Governors Annual Occupational Safety &amp; Health Awards Program.\r\n\r\n<em>\"The Health &amp; Safety program we've developed at Summit Drilling has matured measurably over the past few years\",</em>states Denis Crayon, Summit's Director of Health &amp; Safety. <em>\"Having these years to train, regularly reinforce safe practices and share current and historic data with Summit's field personnel and operations team has brought a new level of understanding the to the table. The quantifiable value of their health and safety investment is continually validated by this award, as well as their ongoing achievement.\"</em>\r\n\r\nSummit Drilling's Experience Safety Program has racked up some impressive numbers. As of September 5, 2013, Summit Drilling has worked 1337 consecutive workdays without a lost time incident representing approximately 416,140 man-hours worked. Prior to receiving this 85th Annual Governor's Occupational Safety &amp; Health Award, Summit Drilling also received its fourth consecutive Annual Eyes on America Workforce Safety Award this past June.\r\n\r\nIf you would like to learn more about Summit Drilling's Health &amp; Safety program, it's Loss Prevention System, Safety Performance Observations, Near Loss Reporting and Job Safety Analysis, call 800-242-6648 and speak with Denis Crayon, Summit Drilling's Director of Health &amp; Safety and President of the Experience Safety Institute.\r\n\r\nRegular Health &amp; Safety meetings at Summit Drilling are always open to industry colleagues, consulting engineering firms and vendors involved in environmental investigation work.\r\nSummit Drilling's Health &amp; Safety program is in Good Standing with ISNetworld with 28 individually written Health &amp; Safety Programs reviewed and accepted within their Review and Verification Services.\r\n\r\nDenis Crayon will also be a feature speaker at this year's NGWA National EXPO, Nashville, speaking on:\r\n- Tuesday, 12/3, 10:30am – 11:30pm, Globally Harmonized System\r\n- Thursday, 12/5, 10:00am - 12:00pm, OSHA &amp; Us, Are We There Yet?\r\n\r\n<strong>Summit Drilling</strong> is a leading environmental services company offering drilling, direct push sampling, sonic technology and injection expertise. For more information about Summit's extensive array of services, call 800-242-6648. Summit is headquartered in Bridgewater, New Jersey with regional offices in Mount Laurel, NJ and Warrington, PA.\r\n\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n<div id=\"ft\"></div>",
    "slug": "summit-drillings-experience-safety-program-recognized-four-years-consecutively-and-counting",
    "date": "2015-11-12 13:33:13",
    "thumbnailId": "596",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/11/news-safety-award4.jpg"
  },
  {
    "id": "104",
    "title": "Turning a Wrench Into High Performance Customer Satisfaction",
    "content": "Summit Drilling's Veteran Fleet Management and Maintenance Team has operations in perfect alignment with customer needs. Since internalizing their fleet management and maintenance program, Summit customers are already benefitting from extraordinary gains in field productivity, nearly zero downtime, increased project scheduling flexibility, and perhaps most important, partners who continue to fortify the company's Health and Safety culture and performance.",
    "fullContent": "Summit Drilling's Veteran Fleet Management and Maintenance Team has operations in perfect alignment with customer needs. Since internalizing their fleet management and maintenance program, Summit customers are already benefitting from extraordinary gains in field productivity, nearly zero downtime, increased project scheduling flexibility, and perhaps most important, partners who continue to fortify the company's Health and Safety culture and performance.",
    "slug": "turning-a-wrench-into-high-performance-customer-satisfaction",
    "date": "2015-11-12 13:21:07",
    "thumbnailId": "832",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/11/News-Fleet-Maintenance-Team.jpg"
  },
  {
    "id": "655",
    "title": "Environmental Services Leader Expands Footprint in Greater Philadelphia Region",
    "content": "Mount Laurel, NJ - June 4, 2012. Summit Drilling, one of the Northeast's largest environmental services companies, has merged Tabasco Drilling into its Southern New Jersey operation. This move furthers the company's strategy to encompass the northeast while expanding their presence in the Mid-Atlantic States.\r\n\r\n\"This move is significant for us\", states Tory Donnelly, Vice President of Operations, Southern New Jersey. \"We have added seven talented professionals, several pieces of key equipment a...",
    "fullContent": "Mount Laurel, NJ - June 4, 2012. Summit Drilling, one of the Northeast's largest environmental services companies, has merged Tabasco Drilling into its Southern New Jersey operation. This move furthers the company's strategy to encompass the northeast while expanding their presence in the Mid-Atlantic States.\r\n\r\n\"This move is significant for us\", states Tory Donnelly, Vice President of Operations, Southern New Jersey. \"We have added seven talented professionals, several pieces of key equipment and a 10,000 sq. ft. facility to our operation in South Jersey alone. More importantly, we have many new customers from Tabasco Drilling in our care and they're already providing us the opportunity to demonstrate our ability. We're delivering a wide variety of drilling services all supported by our industry leading \"Experience Safety\" H&S programs\", adds Ms. Donnelly.\r\n\r\nJoe Tabasco has been involved in the drilling industry since 1965 and founded Tabasco Drilling Corporation in 1990. \"It was important for me to find a partner who maintained the same level of commitment to customers,\" stated Joe Tabasco. \"Bob Kreilick (CEO of Summit Drilling) has built his business and reputation on providing an exceptional experience to customers. What more could I ask for? \"I feel that my customers not only have a talented and safety conscious service provider to support them, but one that can offer them an expanded platform of services as their needs grow,\" concludes Mr. Tabasco.\r\n\r\nDuring the first months as a combined operation, all new Summit Drilling employees were trained in Summit's Health & Safety program. \"I was impressed with the quantity and quality of the training Denis Crayon [Summit Drilling's Health & Safety Director] provided our staff in the initial weeks\", states Rick Davis, Summit's Operations Manager - Southern New Jersey and long time manager of operations for Tabasco. \"I think he spent more days per week here in Mount Laurel than he did at Summit's headquarters in Bridgewater. Starting with Health & Safety was a great way for our guys to get to know people from Summit while learning the importance of safety as the number one value in Summit's culture. Our merge into Summit Drilling has been very smooth and our customers have been very comfortable with our service and ability to deliver\", concludes Mr. Davis.\r\n\r\nSummit Drilling now offers the same wide range of environmental services to Southern New Jersey, as well as Pennsylvania and regions of Delaware, including Roto-Sonic, Air Rotary, Hollow Stem Auger, Mud Rotary, Direct Push and Injection services. In addition to fully staffed field services teams complete with project managers, field services team supervisors, master drillers, licensed drillers and driller apprentices, Summit Drilling has been honored for the third consecutive year with the Governor's Annual Occupational Safety & Health Award.",
    "slug": "environmental-services-leader-expands-footprint-in-greater-philadelphia-region",
    "date": "2015-11-12 12:01:09",
    "thumbnailId": "656",
    "imageUrl": "http://localhost:10140/wp-content/uploads/2015/12/news-tabasco.jpg"
  }
]